import { CampusCoordinate } from "../types/togethermap.interface";

export const MESSAGE_LIST = {};

export const CAMPUS_LIST = ["0", "서울", "대전", "광주", "구미", "부울경"];

export const HASHTAG_LIST = [
  "0",
  "👤 1인",
  "👥 다수",
  "🔕 조용한",
  "🌞 햇살좋은",
  "📢 붐비는",
  "🧹 깔끔한",
  "👖 빈티지",
  "📷 인스타감성",
  "💪 건강한",
  "🚗 주차편한",
  "🥅 넓은",
  "🤵 친절한",
  "🌉 경치좋은",
  "🍲 푸짐한",
  "😋 맛있는",
  "💰 가성비",
  "🌟 밝은",
  "🔦 어두운",
  "💬 대화",
  "📖 공부",
  "🎧 음악감상",
  "🍻 회식",
  "🚶 산책",
  "👩‍💻 코딩",
  "⛺ 24시간",
  "🌅 아침일찍",
  "🌃 밤늦게",
];

<<<<<<< HEAD
export const RATING_LIST = ["0", "😄", "🙄", "😡"];
=======
export const CAMPUS_COORDINATE_LIST: CampusCoordinate = {
  서울: { lat: 37.5012896829276, lan: 127.0396470750927 },
  광주: { lat: 35.20528528929143, lan: 126.81158503905786 },
  구미: { lat: 36.10187832714738, lan: 128.39248825530834 },
  대전: { lat: 36.355246983779615, lan: 127.29833653752476 },
  부울경: { lat: 35.09372804997492, lan: 128.85628470609004 },
};
>>>>>>> 209cc8e4ce92346d8059a84f65dbe970a09f6809
